[{"scenario": "When we first got divorced our son was 4. He was perfectly healthy and she got primary custody. I asked for and received every other weekend. The court ordered me to pay a set amount of child support a month. I pay it. She carries health insurance and pays for day care. I just pay the court ordered amount that lines up with my income.  About a year ago he started having seizures. Some of them lasted a long time which led to some hospitalizations. That led to a host of appts at specialist and she took a leave from work to deal with it all. I work erratic hours and go to college so although I visited him at the hospital a few times.  I couldn’t make it to the appts. The medical bills came rolling in and she asked me to help. I don’t have any more money so I told her no. She asked me to watch him sometimes so she could go back to work and make up some hours so she could pay the bills. I told her to get a babysitter. She said she couldn’t afford one. I can’t see him during the week because of my school schedule and work schedule so I told her no. The court order says nothing about medical bills and me having to pay half. Now she wants to enroll him in some kind of summer camp for kids with epilepsy because she said sending him to a regular daycare is hard since they often don’t know how to deal with his seizures. She asked if I could at least help pay for some of it. Even a small portion. Again, I’ve no money so I said no. Now she wants to be in a medical trial for the seizures but the doctor won’t let her in unless he can meet with me but he can only meet with me during the week. They are claiming it is because there are overnights involved. I am busy then. I also think the study isn’t necessary. Medicine is controlling them mostly. I am poor college student. I just don’t have the money. She says I am an asshole for only paying the bare minimum and never helping out more. My argument is that I pay child support as ordered and I take my every other weekend. I do my part. I do what is required. I am not her partner anymore and I don’t think it is my job to help her out.", "scenario_idx": 8, "choice": "I decide torefuse to pay more of my son's expenses", "entities": "I,our son,she", "values": ["responsibility", "independence", "self-reliance", "tough love", "financial prudence", "autonomy", "neglect", "selfishness", "irresponsibility", "lack of empathy", "unreliability"], "outcomes": ["My son may not be able to attend the specialized summer camp for kids with epilepsy.", "My ex-partner may experience increased financial stress due to covering all medical and care expenses alone.", "My relationship with my ex-partner may become more strained.", "My son may not receive the most beneficial care and support for his condition due to financial constraints.", "My refusal to adjust my schedule may prevent me from being involved in important decisions or treatments for my son's health condition."]}]