[{"scenario": "I (24M) have been with my girlfriend(29F) for a little over a year now, and we have been living together for the past ~6 months. She is originally from Taiwan, and is trying to make a life for herself here. I realized a long time ago that I didn't see a future with her. However, I have stayed with her because I just can't imagine breaking up with her, and her having to make a life for herself here with little to no help. I pay for our rent (I have a good job for a 24 y/o, so its not really a financial burden), take her to school, and do the majority of the cooking. I feel like she would have a hard time surviving in America without someone to help her out (mainly financially). Her English is extremely poor, so she has a lot of difficulty talking to people here. I feel really guilty about this situation, because I feel like I am wasting her time. I figured I could stay with her up until the point she can stand on her own two feet here and support herself. She is an extremely kind person, and I want the best for her. I want her to find someone who truly loves her and wants to build a future with her. ", "scenario_idx": 1, "choice": "I ask her how she would prefer we proceed", "entities": "I,girlfriend", "outcomes": ["My girlfriend may feel valued and respected because I am considering her preferences in the decision-making process.", "The conversation may lead to a mutual understanding of their relationship's future.", "My girlfriend might experience stress or anxiety over the possibility of the relationship ending.", "They may come up with a plan that supports her independence while gradually transitioning out of the relationship.", "My honesty may cause my girlfriend to feel betrayed or hurt if she was unaware of my feelings.", "The discussion could potentially strengthen our relationship if we decide to work through my concerns together.", "My girlfriend might feel insecure about her ability to make a life for herself in America without my support."]}]