[{"id": 0, "text": "My older sister (23) has a dog and forces almost every responsibility on my mother and younger sister(13). I refuse to do anything to help with the dog as me and my older sister got in a big argument before she got it as i knew she wasn’t ready to take care of a dog. But sometimes I do cave in and help out as I feel bad for the dog. The dog is untrained as after many years and daily will pee on the floors and poops inside the home, we live in a small apartment and its really awful. My older sister these past few months lives with her BF and only returns like a day or two each week. Thus leaving everything to my sister and mother. I think its really unfair for her to just abandon the dog, my mother is always complaining about it to get me or my little sister to clean after it, everyday I have to dodge stepping in piss. Also, smelling piss and seeing shit on the floor everyday is not fun. I really dislike having to see this dog being left like this, nobody really plays with it and barely takes it out for walks and it breaks my heart. She has been jobless for over a year now and I’m baffled as to why she cant train it or take care of it. I don’t think she is fit to have this dog and I think the dog would have a better life in another home, I just can't bare watching nobody care for it anymore and waking up and coming home to warm piss and shit.", "options": {"1": "refuse to take care of the dog unless my sister steps up and takes responsibility.", "2": "continue taking care of it", "3": "demand that my sister gives the dog up for adoption to a better home."}},
{"id": 1, "text": "I (24M) have been with my girlfriend(29F) for a little over a year now, and we have been living together for the past ~6 months. She is originally from Taiwan, and is trying to make a life for herself here. I realized a long time ago that I didn't see a future with her. However, I have stayed with her because I just can't imagine breaking up with her, and her having to make a life for herself here with little to no help. I pay for our rent (I have a good job for a 24 y/o, so its not really a financial burden), take her to school, and do the majority of the cooking. I feel like she would have a hard time surviving in America without someone to help her out (mainly financially). Her English is extremely poor, so she has a lot of difficulty talking to people here. I feel really guilty about this situation, because I feel like I am wasting her time. I figured I could stay with her up until the point she can stand on her own two feet here and support herself. She is an extremely kind person, and I want the best for her. I want her to find someone who truly loves her and wants to build a future with her. ", "options": {"1": "continue to support her", "2": "break up with her", "3": "ask her how she would prefer we proceed"}},
{"id": 2, "text": "I recently got my 1st job and I was super excited. I've been searching for a few months and I finally got hired by a local store. You know what they say, you should never be late to work, especially if it's your very first day of your very first job. The shop is about a half an hour walk from my house and I had to be there at 7:40 to open and prepare before 8 o'clock. I left my home around 7:10 to be extra sure I would arrive on time. After about 15 minutes I was on this really long uphill road when at the end of it I see someone on a bike going extremely fast. After about 4-5 seconds I heard a loud noise and turned my head around to see that he has crashed after, I imagine, going over a pothole. He must have been about 50 meters away from me by then. But my boss is really strict and upsetting him was the last thing I wanted on my first day.", "options": {"1": "stop to help and be late for work", "2": "don't stop to help"}},
{"id": 3, "text": "About three weeks ago, my girlfriend was driving while I was a passenger. We were at a four way stop and if I'm being totally honest, I think she went when it wasn't her turn but it was really close and her car and the other guys hit each other at an angle so it was really hard to tell who was at fault. My girlfriend is about 3/4 African American but still somewhat light skinned. When we got out of the car, the other guy was an older man who was clearly agitated but as god as my witness I did not hear him say anything rude, let alone derogatory towards my girlfriend's race. He had called the police even before getting out of the car and I think it took them less than 10 minutes to get there. My girlfriend sat in her car calling her parents while the other guy and I did our best to redirect traffic around the two cars. When the police came up my girlfriend instantly went from calm and collected to tears streaming down her face when they asked her what happened she said that she saw the other guy look at her and then from her perspective hit her car on purpose. She also said that as soon as he got out of the car he started screaming at her things like \"this is why m*****'s shouldn't be behind the wheel and that she's an n-word who would be better in chains among other things. I was speechless and kept telling myself \"say something, just say something.", "options": {"1": "tell the cops what I really saw and contradict my girlfriend", "2": "say nothing"}},
{"id": 4, "text": "So: I’m a single 23 year old guy. I work in a lab, and we’ve taken volunteers to help with field work before. A few months back, I’m paired up with Ann (not her actual name) at a mass Audubon station, where we checked over deer registered during the first week of hunting season. Ann is from Vietnam. This is our first time meeting, and there’s a smidge of a language barrier. We’re stuck together for six hours or so, so we chat. She mentions her hopes and dreams to go to med school, but that she’s concerned about taking the MCAT because her English isn’t very good. I tell her that I can’t really help with much of the rest of the rest, but if she needs a hand with the English portions, I could try to walk her through a practice exam. Admittedly, never actually thought she would take me up on it. Flash forward to last week- she found me on Facebook and asked me for help. She was nice enough, and since I had promised, I said yes. A few things became pretty clear pretty quickly: 1. It became very clear, very fast that she isn’t going to pass the MCAT- or at least not the sections she was going over with me. She seems to know this. 2. She mentioned that she doesn’t want to go back to Vietnam, her visa is expiring soon, and if she can’t pass the test she’ll either need to get married or head home. 3. She was interested in doing /much/ more than studying for the MCAT. Now, this is where friends have called me the asshole: she started calling herself short, fat, and ugly, more or less out of nowhere. I said she “was definitely short, but fat and ugly? Not so much.” Apparently this was leading her on that I was interested, while I thought it was just keeping someone from insulting themselves too harshly. Again: I genuinely was only interested in helping her study.  Apparently, it’s pretty unreasonable to help a stranger like this and /not/ assume something sexual or beginnings of relationship-y are involved/will become involved. So, when she offered me a tour of her apartment, and showed me to her bedroom: I said 'oh, your bed is made differently than mine,' and played full-oblivious with her. Left pretty soon afterwards, with a hug and a “happy to help. She texted me the next day, very politely thanked me, and asked if I could help her again sometime.", "options": {"1": "agree to help her", "2": " politely refuse"}}, 
{"id": 5, "text": "We all had previously used my cousin's HBO Go account but she recently got rid of her cable. My family is eager to watch the upcoming season of Game of Thrones, and they suggested we all pitch in to share an HBO account. The thing is though, I already have one. I got it through Hulu, but I don't want to share my account with them. My family is incredibly conservative and judgmental, especially my brother. It's why I love that they love Game of Thrones so much. For once in my life, they're taking an interest in something I love. I've always been the black sheep in my family, and they never cared for and at times downright detested my nerdy interests. But the reason I don't want to give them my account info is because I'll get so much ridicule for the things I watch. We have a family Netflix account and I watched the Conjuring. A few days later, I got a passive aggressive text from my brother wondering why I had watched a 'satanic' movie. Yeah. He monitors what I watch. My parents aren't as bad and won't care what I watch, but if I share my account info with them, they'll either make me give it to my brother or they'll give it to him. As much as I would love to share my account with my parents (because I really do love being able to nerd out with them about GoT), I just don't want to feel like I can't watch the things I want on my own account.", "options": {"1": "share my account with my family", "2": "not share the account, asking everyone to pay for one instead."}},
{"id": 6, "text": " I met a girl on Tinder a couples of months ago, and after a while we had a date. We had a lot of fun and we connected instantly, but she wasn't interested in anything romantic. No big deal, we kept it to friendship (with sometimes things getting a little more physical, but rarely). We've gotten really close since, we text everyday, we see each other as much as possible, we've talked about a lot of really personal stuff. I thought I did a good job of moving on, that I wasn't interested in her that way anymore. Then, a couple of days ago I spent the night at her place. We drank a lot and it was getting late, so she offered me to stay to sleep, it's closer to my job anyway. We didn't have sex or anything, but we cuddled a lot, even though she's usually not a cuddler. The day after I had a hard time leaving, I've never felt so good in my life. That's when I realised that I was lying to myself, my feelings for her are clearly more than just friendship. But if I tell her how I feel, it might hurt the friendship. She has said that she feared to hurt me, she doesn't want me to feel bad because it's not gonna go further than that, so I kinda feel like an asshole for putting her in that situation.", "options": {"1": "write her a message telling her how I really feel", "2": "don’t say anything and potentially hurt our friendship"}},
{"id": 7, "text": "My grandma is an addict with many vices, alcohol and gambling are the to main ones. When my mom was a kid my grandma would get drunk and be both verbally and physically abusive. Shortly after my mom turned 18 my grandma went to prison. She claimed to clean up her act and my mom forgave her and started sending her money. When I was a teen she spent the night at our place one night because she had no where else to go. While I was at school and my mom was at work she stole my life saving that I earned that summer working and she stole all of my moms jewelry. We later found out that she has stolen from just about everyone in the family as soon as they let her in. And she went back to jail for theft. She claims to have cleaned up her act again and my whole family has seemed to forgiven her. I haven't and I won't. I have zero respect for someone who will lie, steal, and beat their own family (especially their own child). So this year since it is the first year that I have my own place I wanted to throw a Christmas party for my family. Someone invited her without my knowledge and she arrives at my house.", "options": {"1": "ask her to leave the house", "2": "allow her to stay"}},
{"id": 8, "text": "When we first got divorced our son was 4. He was perfectly healthy and she got primary custody. I asked for and received every other weekend. The court ordered me to pay a set amount of child support a month. I pay it. She carries health insurance and pays for day care. I just pay the court ordered amount that lines up with my income.  About a year ago he started having seizures. Some of them lasted a long time which led to some hospitalizations. That led to a host of appts at specialist and she took a leave from work to deal with it all. I work erratic hours and go to college so although I visited him at the hospital a few times.  I couldn’t make it to the appts. The medical bills came rolling in and she asked me to help. I don’t have any more money so I told her no. She asked me to watch him sometimes so she could go back to work and make up some hours so she could pay the bills. I told her to get a babysitter. She said she couldn’t afford one. I can’t see him during the week because of my school schedule and work schedule so I told her no. The court order says nothing about medical bills and me having to pay half. Now she wants to enroll him in some kind of summer camp for kids with epilepsy because she said sending him to a regular daycare is hard since they often don’t know how to deal with his seizures. She asked if I could at least help pay for some of it. Even a small portion. Again, I’ve no money so I said no. Now she wants to be in a medical trial for the seizures but the doctor won’t let her in unless he can meet with me but he can only meet with me during the week. They are claiming it is because there are overnights involved. I am busy then. I also think the study isn’t necessary. Medicine is controlling them mostly. I am poor college student. I just don’t have the money. She says I am an asshole for only paying the bare minimum and never helping out more. My argument is that I pay child support as ordered and I take my every other weekend. I do my part. I do what is required. I am not her partner anymore and I don’t think it is my job to help her out.", "options": {"1": "refuse to pay more", "2": "offer to pay more"}},
{"id": 9, "text": "I work customer service for a retail giant. Would prefer not to name them just to be safe, but trust me, you've heard of them. Yesterday, a woman comes to the front of the line and starts yelling at me that her Visa prepaid gift card didn't have the money on it. I pointed out the number for her to call, she calmed down and left. Then she came back, once again approaching me screaming. She yelled that no one answered on the end, and that she needed her money right away. I told her there was nothing we could do, VISA gift cards are out of our hands. I called a manager over to see if the manager could do something I could not. While the manager tries multiple things to help them (calling the number for her, checking our system to see if it activated) our hands ended up being tied. Customer service for VISA said something about 3 business days. The lady kept shouting, saying that the cashier lied to her about it being active right away (note: they normally are active right away, this gift card had glitched). I gathered from the ongoing conversation that the reason she was so desperate for this money was that she needed it to pay her electric bill which was due today. Suddenly it made sense why she was so frantic. She made a comment in a distressed tone saying ‘I wouldn't do this if I didn't need to, everyone is staring at me!’. I considered buying the $25 gift card off of her, getting cash on my upcoming lunch hour, but I am low on funds, and would either have to tighten my belt or dip into my college/emergency funds and end the pay period with less than $10. I wasn't sure if the gift card would work later. But it would be dishonest if I didn't admit that I hesitate because that she had yelled at me the whole time.", "options": {"1": "buy her the gift card", "2": "don’t buy her a gift card"}},
{"id": 10, "text": "So a few months ago my friend J told me and my other friend V she wanted us to all go on a travel/volunteer vacation, we all made suggestions and decided to do a trip to help turtles, nothings booked but we were talking about doing it in a year. So J, who originally brought up the idea, said she wouldn’t be able to go because of finances.", "options": {"1": "I still go on the trip with V", "2": "I cancel or postpone the trip until J can go"}}]

