[{"id": 0, "text": "My older sister (23) has a dog and forces almost every responsibility on my mother and younger sister(13). I refuse to do anything to help with the dog as me and my older sister got in a big argument before she got it as i knew she wasn’t ready to take care of a dog. But sometimes I do cave in and help out as I feel bad for the dog. The dog is untrained as after many years and daily will pee on the floors and poops inside the home, we live in a small apartment and its really awful. My older sister these past few months lives with her BF and only returns like a day or two each week. Thus leaving everything to my sister and mother. I think its really unfair for her to just abandon the dog, my mother is always complaining about it to get me or my little sister to clean after it, everyday I have to dodge stepping in piss. Also, smelling piss and seeing shit on the floor everyday is not fun. I really dislike having to see this dog being left like this, nobody really plays with it and barely takes it out for walks and it breaks my heart. She has been jobless for over a year now and I’m baffled as to why she cant train it or take care of it. I don’t think she is fit to have this dog and I think the dog would have a better life in another home, I just can't bare watching nobody care for it anymore and waking up and coming home to warm piss and shit.", "options": {"1": "refuse to take care of the dog unless my sister steps up and takes responsibility.", "2": "continue taking care of it", "3": "demand that my sister gives the dog up for adoption to a better home."}},
{"id": 1, "text": "I (24M) have been with my girlfriend(29F) for a little over a year now, and we have been living together for the past ~6 months. She is originally from Taiwan, and is trying to make a life for herself here. I realized a long time ago that I didn't see a future with her. However, I have stayed with her because I just can't imagine breaking up with her, and her having to make a life for herself here with little to no help. I pay for our rent (I have a good job for a 24 y/o, so its not really a financial burden), take her to school, and do the majority of the cooking. I feel like she would have a hard time surviving in America without someone to help her out (mainly financially). Her English is extremely poor, so she has a lot of difficulty talking to people here. I feel really guilty about this situation, because I feel like I am wasting her time. I figured I could stay with her up until the point she can stand on her own two feet here and support herself. She is an extremely kind person, and I want the best for her. I want her to find someone who truly loves her and wants to build a future with her. ", "options": {"1": "continue to support her", "2": "break up with her", "3": "ask her how she would prefer we proceed"}},
{"id": 2, "text": "I recently got my 1st job and I was super excited. I've been searching for a few months and I finally got hired by a local store. You know what they say, you should never be late to work, especially if it's your very first day of your very first job. The shop is about a half an hour walk from my house and I had to be there at 7:40 to open and prepare before 8 o'clock. I left my home around 7:10 to be extra sure I would arrive on time. After about 15 minutes I was on this really long uphill road when at the end of it I see someone on a bike going extremely fast. After about 4-5 seconds I heard a loud noise and turned my head around to see that he has crashed after, I imagine, going over a pothole. He must have been about 50 meters away from me by then. But my boss is really strict and upsetting him was the last thing I wanted on my first day.", "options": {"1": "stop to help and be late for work", "2": "don't stop to help"}},
{"id": 3, "text": "About three weeks ago, my girlfriend was driving while I was a passenger. We were at a four way stop and if I'm being totally honest, I think she went when it wasn't her turn but it was really close and her car and the other guys hit each other at an angle so it was really hard to tell who was at fault. My girlfriend is about 3/4 African American but still somewhat light skinned. When we got out of the car, the other guy was an older man who was clearly agitated but as god as my witness I did not hear him say anything rude, let alone derogatory towards my girlfriend's race. He had called the police even before getting out of the car and I think it took them less than 10 minutes to get there. My girlfriend sat in her car calling her parents while the other guy and I did our best to redirect traffic around the two cars. When the police came up my girlfriend instantly went from calm and collected to tears streaming down her face when they asked her what happened she said that she saw the other guy look at her and then from her perspective hit her car on purpose. She also said that as soon as he got out of the car he started screaming at her things like \"this is why m*****'s shouldn't be behind the wheel and that she's an n-word who would be better in chains among other things. I was speechless and kept telling myself \"say something, just say something.", "options": {"1": "tell the cops what I really saw and contradict my girlfriend", "2": "say nothing"}}]
