[{"id": 0, "text": "My older sister (23) has a dog and forces almost every responsibility on my mother and younger sister(13). I refuse to do anything to help with the dog as me and my older sister got in a big argument before my sister got it as i knew my sister wasn't ready to take care of a dog. But sometimes I do cave in and help out as I feel bad for the dog. The dog is untrained as after many years and daily will pee on the floors and poops inside the home, we live in a small apartment and its really awful. My older sister these past few months lives with her BF and only returns like a day or two each week. Thus leaving everything to my sister and mother. I think its really unfair for her to just abandon the dog, my mother is always complaining about it to get me or my little sister to clean after it, everyday I have to dodge stepping in piss. Also, smelling piss and seeing shit on the floor everyday is not fun. I really dislike having to see this dog being left like this, nobody really plays with it and barely takes it out for walks and it breaks my heart. She has been jobless for over a year now and I'm baffled as to why my sister cant train it or take care of it. I don't think my sister is fit to have this dog and I think the dog would have a better life in another home, I just can't bare watching nobody care for it anymore and waking up and coming home to warm piss and shit.", "options": {"1": "refuse to take care of the dog unless my sister steps up and takes responsibility.", "2": "continue taking care of it", "3": "demand that my sister gives the dog up for adoption to a better home."}},
{"id": 1, "text": "I (24M) have been with my girlfriend(29F) for a little over a year now, and we have been living together for the past ~6 months. She is originally from Taiwan, and is trying to make a life for herself here. I realized a long time ago that I didn't see a future with her. However, I have stayed with her because I just can't imagine breaking up with her, and her having to make a life for herself here with little to no help. I pay for our rent (I have a good job for a 24 y/o, so its not really a financial burden), take her to school, and do the majority of the cooking. I feel like she would have a hard time surviving in America without someone to help her out (mainly financially). Her English is extremely poor, so she has a lot of difficulty talking to people here. I feel really guilty about this situation, because I feel like I am wasting her time. I figured I could stay with her up until the point she can stand on her own two feet here and support herself. She is an extremely kind person, and I want the best for her. I want her to find someone who truly loves her and wants to build a future with her. ", "options": {"1": "continue to support her", "2": "break up with her", "3": "ask her how she would prefer we proceed"}},
{"id": 2, "text": "I recently got my 1st job and I was super excited. I've been searching for a few months and I finally got hired by a local store. You know what they say, you should never be late to work, especially if it's your very first day of your very first job. The shop is about a half an hour walk from my house and I had to be there at 7:40 to open and prepare before 8 o'clock. I left my home around 7:10 to be extra sure I would arrive on time. After about 15 minutes I was on this really long uphill road when at the end of it I see someone on a bike going extremely fast. After about 4-5 seconds I heard a loud noise and turned my head around to see that he has crashed after, I imagine, going over a pothole. He must have been about 50 meters away from me by then. But my boss is really strict and upsetting him was the last thing I wanted on my first day.", "options": {"1": "stop to help and be late for work", "2": "don't stop to help"}},
{"id": 3, "text": "About three weeks ago, my girlfriend was driving while I was a passenger. We were at a four way stop and if I'm being totally honest, I think she went when it wasn't her turn but it was really close and her car and the other guys hit each other at an angle so it was really hard to tell who was at fault. My girlfriend is about 3/4 African American but still somewhat light skinned. When we got out of the car, the other guy was an older man who was clearly agitated but as god as my witness I did not hear him say anything rude, let alone derogatory towards my girlfriend's race. He had called the police even before getting out of the car and I think it took them less than 10 minutes to get there. My girlfriend sat in her car calling her parents while the other guy and I did our best to redirect traffic around the two cars. When the police came up my girlfriend instantly went from calm and collected to tears streaming down her face when they asked her what happened she said that she saw the other guy look at her and then from her perspective hit her car on purpose. She also said that as soon as he got out of the car he started screaming at her things like \"this is why m*****'s shouldn't be behind the wheel and that she's an n-word who would be better in chains among other things. I was speechless and kept telling myself \"say something, just say something.", "options": {"1": "tell the cops what I really saw and contradict my girlfriend", "2": "say nothing"}},
{"id": 4, "text": "So: I’m a single 23 year old guy. I work in a lab, and we’ve taken volunteers to help with field work before. A few months back, I’m paired up with Ann (not her actual name) at a mass Audubon station, where we checked over deer registered during the first week of hunting season. Ann is from Vietnam. This is our first time meeting, and there’s a smidge of a language barrier. We’re stuck together for six hours or so, so we chat. She mentions her hopes and dreams to go to med school, but that she’s concerned about taking the MCAT because her English isn’t very good. I tell her that I can’t really help with much of the rest of the rest, but if she needs a hand with the English portions, I could try to walk her through a practice exam. Admittedly, never actually thought she would take me up on it. Flash forward to last week- she found me on Facebook and asked me for help. She was nice enough, and since I had promised, I said yes. A few things became pretty clear pretty quickly: 1. It became very clear, very fast that she isn’t going to pass the MCAT- or at least not the sections she was going over with me. She seems to know this. 2. She mentioned that she doesn’t want to go back to Vietnam, her visa is expiring soon, and if she can’t pass the test she’ll either need to get married or head home. 3. She was interested in doing /much/ more than studying for the MCAT. Now, this is where friends have called me the asshole: she started calling herself short, fat, and ugly, more or less out of nowhere. I said she “was definitely short, but fat and ugly? Not so much.” Apparently this was leading her on that I was interested, while I thought it was just keeping someone from insulting themselves too harshly. Again: I genuinely was only interested in helping her study.  Apparently, it’s pretty unreasonable to help a stranger like this and /not/ assume something sexual or beginnings of relationship-y are involved/will become involved. So, when she offered me a tour of her apartment, and showed me to her bedroom: I said 'oh, your bed is made differently than mine,' and played full-oblivious with her. Left pretty soon afterwards, with a hug and a “happy to help. She texted me the next day, very politely thanked me, and asked if I could help her again sometime.", "options": {"1": "agree to help her", "2": " politely refuse"}}, 
{"id": 5, "text": "We all had previously used my cousin's HBO Go account but she recently got rid of her cable. My family is eager to watch the upcoming season of Game of Thrones, and they suggested we all pitch in to share an HBO account. The thing is though, I already have one. I got it through Hulu, but I don't want to share my account with them. My family is incredibly conservative and judgmental, especially my brother. It's why I love that they love Game of Thrones so much. For once in my life, they're taking an interest in something I love. I've always been the black sheep in my family, and they never cared for and at times downright detested my nerdy interests. But the reason I don't want to give them my account info is because I'll get so much ridicule for the things I watch. We have a family Netflix account and I watched the Conjuring. A few days later, I got a passive aggressive text from my brother wondering why I had watched a 'satanic' movie. Yeah. He monitors what I watch. My parents aren't as bad and won't care what I watch, but if I share my account info with them, they'll either make me give it to my brother or they'll give it to him. As much as I would love to share my account with my parents (because I really do love being able to nerd out with them about GoT), I just don't want to feel like I can't watch the things I want on my own account.", "options": {"1": "share my account with my family", "2": "not share the account, asking everyone to pay for one instead."}},
{"id": 6, "text": "I met a girl on Tinder a couples of months ago, and after a while we had a date. We had a lot of fun and we connected instantly, but she wasn't interested in anything romantic. No big deal, we kept it to friendship (with sometimes things getting a little more physical, but rarely). We've gotten really close since, we text everyday, we see each other as much as possible, we've talked about a lot of really personal stuff. I thought I did a good job of moving on, that I wasn't interested in her that way anymore. Then, a couple of days ago I spent the night at her place. We drank a lot and it was getting late, so she offered me to stay to sleep, it's closer to my job anyway. We didn't have sex or anything, but we cuddled a lot, even though she's usually not a cuddler. The day after I had a hard time leaving, I've never felt so good in my life. That's when I realised that I was lying to myself, my feelings for her are clearly more than just friendship. But if I tell her how I feel, it might hurt the friendship. She has said that she feared to hurt me, she doesn't want me to feel bad because it's not gonna go further than that, so I kinda feel like an asshole for putting her in that situation.", "options": {"1": "write her a message telling her how I really feel", "2": "not say anything and potentially hurt our friendship"}},
{"id": 7, "text": "My grandma is an addict with many vices, alcohol and gambling are the to main ones. When my mom was a kid my grandma would get drunk and be both verbally and physically abusive. Shortly after my mom turned 18 my grandma went to prison. She claimed to clean up her act and my mom forgave her and started sending her money. When I was a teen she spent the night at our place one night because she had no where else to go. While I was at school and my mom was at work she stole my life saving that I earned that summer working and she stole all of my moms jewelry. We later found out that she has stolen from just about everyone in the family as soon as they let her in. And she went back to jail for theft. She claims to have cleaned up her act again and my whole family has seemed to forgiven her. I haven't and I won't. I have zero respect for someone who will lie, steal, and beat their own family (especially their own child). So this year since it is the first year that I have my own place I wanted to throw a Christmas party for my family. Someone invited her without my knowledge and she arrives at my house.", "options": {"1": "ask my grandmother to leave the house", "2": "allow my grandmother to stay"}},
{"id": 8, "text": "When we first got divorced our son was 4. He was perfectly healthy and she got primary custody. I asked for and received every other weekend. The court ordered me to pay a set amount of child support a month. I pay it. She carries health insurance and pays for day care. I just pay the court ordered amount that lines up with my income.  About a year ago he started having seizures. Some of them lasted a long time which led to some hospitalizations. That led to a host of appts at specialist and she took a leave from work to deal with it all. I work erratic hours and go to college so although I visited him at the hospital a few times.  I couldn’t make it to the appts. The medical bills came rolling in and she asked me to help. I don’t have any more money so I told her no. She asked me to watch him sometimes so she could go back to work and make up some hours so she could pay the bills. I told her to get a babysitter. She said she couldn’t afford one. I can’t see him during the week because of my school schedule and work schedule so I told her no. The court order says nothing about medical bills and me having to pay half. Now she wants to enroll him in some kind of summer camp for kids with epilepsy because she said sending him to a regular daycare is hard since they often don’t know how to deal with his seizures. She asked if I could at least help pay for some of it. Even a small portion. Again, I’ve no money so I said no. Now she wants to be in a medical trial for the seizures but the doctor won’t let her in unless he can meet with me but he can only meet with me during the week. They are claiming it is because there are overnights involved. I am busy then. I also think the study isn’t necessary. Medicine is controlling them mostly. I am poor college student. I just don’t have the money. She says I am an asshole for only paying the bare minimum and never helping out more. My argument is that I pay child support as ordered and I take my every other weekend. I do my part. I do what is required. I am not her partner anymore and I don’t think it is my job to help her out.", "options": {"1": "refuse to pay more of my son's expenses", "2": "offer to pay more of my son's expenses"}},
{"id": 9, "text": "I work customer service for a retail giant. Would prefer not to name them just to be safe, but trust me, you've heard of them. Yesterday, a woman comes to the front of the line and starts yelling at me that her Visa prepaid gift card didn't have the money on it. I pointed out the number for her to call, she calmed down and left. Then she came back, once again approaching me screaming. She yelled that no one answered on the end, and that she needed her money right away. I told her there was nothing we could do, VISA gift cards are out of our hands. I called a manager over to see if the manager could do something I could not. While the manager tries multiple things to help them (calling the number for her, checking our system to see if it activated) our hands ended up being tied. Customer service for VISA said something about 3 business days. The lady kept shouting, saying that the cashier lied to her about it being active right away (note: they normally are active right away, this gift card had glitched). I gathered from the ongoing conversation that the reason she was so desperate for this money was that she needed it to pay her electric bill which was due today. Suddenly it made sense why she was so frantic. She made a comment in a distressed tone saying ‘I wouldn't do this if I didn't need to, everyone is staring at me!’. I considered buying the $25 gift card off of her, getting cash on my upcoming lunch hour, but I am low on funds, and would either have to tighten my belt or dip into my college/emergency funds and end the pay period with less than $10. I wasn't sure if the gift card would work later. But it would be dishonest if I didn't admit that I hesitate because that she had yelled at me the whole time.", "options": {"1": "buy her the gift card", "2": "not buy her a gift card"}},
{"id": 10, "text": "So a few months ago my friend J told me and my other friend V she wanted us to all go on a travel/volunteer vacation, we all made suggestions and decided to do a trip to help turtles, nothings booked but we were talking about doing it in a year. So J, who originally brought up the idea, said she wouldn’t be able to go because of finances.", "options": {"1": "still go on the trip with V", "2": "cancel or postpone the trip until J can go"}},
{"id": 11, "text": "My boyfriend and I have been together for about 3.5 years. We did long distance/only seeing each other a couple of weekends a month until a year ago, when we moved in together.  Our relationship is pretty much perfect in every aspect apart from one - our sex life. Before we moved in together our sex drives were about equal, but over the past few months my boyfriend’s drive has dropped completely. He rarely initiates sex any more, and rejects me 9 times out of 10 when I try to initiate, usually saying that he’s too tired.  I’ve brought it up as an issue at least 3 times now cause I was getting worried something was seriously wrong. Every time we talk about it he says all the right things, reassures me that nothing is wrong, and promises to have sex more regularly, but still nothing has significantly changed.  I’m starting to feel unloved and unattractive. Despite the fact that the rest of our relationship is amazing I don’t know if I can stay with him when I’m feeling like this. I don’t want to throw everything away without trying to work on it one more time, so I was thinking of having another serious talk and explaining that if our sex life doesn’t improve, I’m going  to have to consider the future of the relationship as a whole. But I’m worried that that will come across as a threat. I don’t want to seem like I’m manipulating him into sleeping with me, I just want to get across the severity of the situation and how shitty it’s making me feel.", "options": {"1": "tell him I am considering breaking up with him if our sex life doesn’t improve", "2": "not tell him"}},
{"id": 12, "text": "Me and my ex boyfriend were in a relationship all through high school and had a daughter when were in 10th grade and 16 at the time. We did not have a great relationship because he wanted me to move away from my family with him while he attended the college he got accepted to which was about an 8 hour drive away. We tried long distance for a few months but we broke up as I fell in love with someone else at home and began cheating and got caught.  After a pretty shakey few months we worked out that we would try our best to stay on good terms and we decided a child support payment between ourselves based on what I knew he'd be able to support due to his only working part time while at school. Over the past 3 years I've had 2 more children with the new guy and am a stay at home mom full time while living with my father to take care of all the kids. My father recently had to quit his job due to medical issues and my boyfriend struggles to hold a job and has spent some time in and out of jail recently.  So I have three kids and am really struggling to make ends meet right now. My first daughter's father has made it known to my father in the past that he disapproves of the way I've gone about life, thinking that me having more kids has lessened the opportunities his kid will have. I've also asked him for extra money about 4 times in the past 3 years and each time he gives it, but makes sure to lecture me on getting a job and being more responsible while he's off at college not seeing his kid very often.  He is graduating this spring and will be moving onto a full time engineering job.", "options": {"1": "ask him to pay more money in child support each month", "2": "not ask him for more money in child support"}},
{"id": 13, "text": "'I'm 17 dating a 16 year old girl that goes to another school and lives about 15 minutes away. Relationship is going great, especially considering we can only see each other on weekends. Kind of important note about her: she's fairly shy around new people and tends to be quiet when she feels she has nothing good to add. I'm in a groupchat with 4 close friends (was 5 at the time, 1 has cut us off, but that's unimportant). We've all known each other and have been close friends since middle school. We all have very similar senses of humor and converse very well. This groupchat (while on different platforms) has existed for around 4-5 years. About 4 months ago, we were talking about music in the groupchat. We were talking about some artists that I know my gf likes (we were technically only 'talking' at this point but we were basically dating). I made a comment about how *gf name* would enjoy this conversation, but I didn't think it would be a good idea to add her to the chat. My friends said it would be fine, so I did. We talked about music and such for a bit that night and all seemed fine. After that night she rarely says anything at all in the chat, and if she does it's almost always a single response that doesn't add anything to the conversation. It's been this way the entire time she's been in the chat, but she reads everything that's said in the chat. About a month or two ago, I made an offhand comment to her that if she doesn't want to be in the groupchat then she doesn't have to. She told me that she's fine with being in it and likes to read the messages. We haven't spoken about it since. It kind of makes me uncomfortable having her in the chat. I feel like I have to watch what I say at times (not too often) and the jokes I make (we tend to have an edgy sort of humor). We also talk about some pretty sensitive things at times, things that aren't the end of the world if she knows about but aren't her business whatsoever either. I've briefly talked to the people in the groupchat privately about it and they're indifferent on her being in the chat.", "options": {"1": "ask her to leave the chat", "2": "allow her to stay in the chat"}},
{"id": 14, "text": "I’m a man. I go to get my hair done at this local place, I don’t like barbers generally. There is a fairly camp guy who I’m pretty sure is gay, he seems to always end up being the one assigned to do my hair. He’s very friendly and funny and chatty. I don’t like this. When I was younger I was groomed by a man in a ‘bad touch’ way. I don’t like being touched by gay men.  So I rang up to ask for an appointment, and they say ‘who do you usually have’ and I say ‘the guy, but I would like someone else’. And she said, ‘the guy does the guy’s hair usually’.", "options": {"1": "continue to see the male barber", "2": "insist to see someone else"}},
{"id": 15, "text": "So I am normally not annoyed by anyone and am typically very accepting of new friends and new people. But at the beginning of this school year this girl just showed up and asked to sit at the table am sitting at. I said sure, as I really didn't mind at the time. Now I sincerely regret it.  She immediately started treating me as if we were best friends and she was over sharing her entire life story with me. It made me uncomfortable. She touches me a lot when I'm obviously uncomfortable, and I've even directly told her to stop touching me but she just won't. I've tried to just tune her out and tolerate her- but if she thinks I'm paying to much attention to my phone she literally steals it from me and won't give it back till I pay sufficient attention to her. She will also shove me randomly as a 'joke'. I've told her so many times to stop stealing my stuff and shoving me. I've even gotten so mad I've yelled at her but nothing gets through her head. Anytime I tell her to stop she just goes 'okay, you don't have to act like my mom you idiot' and laughs. It's not funny. Everyone in my friend group does not like her and we are all uncomfortable. I don't want to hurt her feelings but I'm so uncomfortable and irritated around her.", "options": {"1": "be direct and tell her that we are not friends", "2": "not say anything to protect her feelings"}}, 
{"id": 16, "text": "I have been dating my boyfriend for almost six months. He's really caring and sweet and prior to tonight I envisioned us getting married in the near future. I really love dogs, I've had dogs my whole life and have a corgi and she is my favorite thing in the world.  Bf doesn't really like animals but he's always been good with her whenever he's at my apartment and I was never uncomfortable. This is relevant because of a conversation we had tonight that will probably end with me breaking up with him.  We had dinner at a Chinese restaurant tonight.  Bf ordered duck, and enjoyed it a lot.  He commented on how it's cool that in other countries like China, they eat certain meat such as duck that isn't very common in the US.  I mentioned how they still eat dogs, and I told him about how horrific events such as the yulin dog festival are, since I remember reading about this recently on reddit.  I almost cried when I first read details about this, and still almost choked up thinking about it.  I asked him 'you would never eat dog, right?'  I expected him to say no, but he admitted that he had tried dog meat before.  He went on a study abroad to China when he was in college, and tried dog when he was there.  I was shocked and appalled.  I tried being understanding, I assumed that he had eaten some mystery meat dish of some sort and not found out what he had eaten until after.  I was horrified by what he said after.  He went to a restaurant with several Chinese students and tried an assortment of different foods.  One of the dishes was dog, and he knowingly tried it since he was 'curious', and he said it tasted good.  He even said that he was the only American at the table who tried it, and that the rest of his friends were disgusted while the Chinese students laughed.  After he told me this, there was an awkward silence for a while after.  He could tell I was uncomfortable, and said that he probably wouldn't eat it again and that the yulin dog festival is cruel, but that it's not that big of a deal and it's a cultural difference.  At that point I was still in shock and barely responded.  We were both done with our food, or at least he was: I had no appetite left.  We went up to the front of the restaurant and paid the check.  We were going to see a movie but I asked him to just take me home.  I told him that I'd see him later but got out of the car before he could kiss me.  I've spent the last few hours sitting on my couch clinging onto my dog and crying.  I couldn't believe that I had let someone who had eaten dog near my dog, and I was repulsed at the idea of seeing him anymore.  I haven't said anything to my bf ever since I got out of the car but I really want to break up with him. I'm really sad because I thought he was the best guy I've ever dated and I really felt a strong connection to him before tonight, but I can't look at him the same.  I also would never feel comfortable letting him anywhere near my sweet little girl.", "options": {"1": "break up with him", "2": "accept his different views"}},
{"id": 17, "text": "My girlfriend and I get take out or go out to eat a lot because I don't cook and I don't like her cooking. We have this ongoing argument when we go out to eat.   When we get our food I usually want to try some of what she ordered because it looks good. She always says no and sometimes I'll drop it but if I really want to try it, I'll push a little and she'll say yes.  She then pouts because in her words she 'didn't get to eat her whole meal' and she says it's unfair if I try her food because she can't try mine (she's vegetarian and I always order meat). I think this is kind of bs because we should've be eating an equal amount food anyway since I'm a guy and guys need more food. It's not like I eat more than a quarter of her food.", "options": {"1": "continue to ask her to share her food", "2": "no longer ask her to share her food"}},
{"id": 18, "text": "A short back story, I live in an apartment complex on a military base. I recently got a puppy and since I don't have a yard I take him out of the building to do his business. There's other dogs in the building and most of them do the same thing so all the pet owners talk to each other while our dogs go potty. One lady I talked to was new and had a large dog she would take outside and I would talk to her to make her feel welcome. Our apartment complex only allows pets on the first or second floor. She asked which floor I lived on and I said the second and she said she lived on the fourth. I told her dogs weren't allowed on the fourth floor (I have no idea why she wouldn't know this since you have to sign a contract about it and know all the rules since the base is really strict about stuff like this. She also got him after they moved in to the building) She said she didn't know that and thanked me. I didn't think too much about it,I could care less honestly so I let it be. A few weeks later the same lady and her dog are walking around and I noticed he has a vest on. A service dog vest. I was like 'maybe she got him trained because he was a handful before', I walked by her to get into the building with my puppy and the dog lunged, growled, and barked at me and my puppy. It scared me because service dogs aren't supposed to be like that. The same incident happened on the stair way when I was trying to go down and she was trying to go up. Her dog went bonkers and dragged her to my dog and tried to jump on me when I picked up my puppy. I don't know if he's aggressive or just really playful but he's a little concerning to the other dog owners or people with kids because he's so unpredictable. I don't want to be 'that guy' or anything but that's not cool that she's most likely lying about it being a service dog and putting everyone else at risk. My puppy is now scared of other dogs because of these incidents. I'm fine with just minding my own business about it but at the same time she's making other real service dogs look bad as well. I understand she probably did it to keep her dog but there's other ways, the base is understanding and would most likely move her to a house or she could live off base if she wanted to.", "options": {"1": "report her dog", "2": "keep quiet about the dog"}},
{"id": 19, "text": "I live in NYC and have been wanting to go out for hikes with my dog lately. The problem is I have no car and there is nowhere to hike near me. There are trains that run from the city to places upstate where I can hike but most have no-dog policies or restrict the size of the dog significantly. I have an eighty pound golden retriever mutt so it would be impossible to get him on a train.  So the thought occurred to pretend that my dog is a service dog by just purchasing one of the vests for it. And if anybody asks, I can say that he is a seizure response dog. That way I can get on the train with him and I don't need to pretend to be blind or anything. My dog is well behaved and has the look of a service dog, so I think I can get away with it.",  "options": {"1": "disguise my dog as a service dog", "2": "not disguise my dog as a service dog"}},
{"id": 20, "text": "So about a year ago I popped the big question. I was deeply in love with my girlfriend and everything felt amazing. That is until she transformed into a bridezilla in front of my eyes. Ever since we got engaged all she can do is talk about the wedding, which was fine at first but it started to consume her. I thought that I would get some say in how the day was going to go but everything I suggest is immediately shot down. The only choice I got to make was my tux and even that had to fit her God damn color scheme. Well things really started ramping up when her mother came down for the weekend. She's your typical trailer trash woman who married into a successful family. All her ideas are awful and tacky yet my fiancee laps it up like a dehydrated person in a desert. When I try to bring it up with her she tells me that this is 'her' big day and I should just be supportive. I told her it was my money and that I should have more say in how it's spent. Her mom picked out maroon table clothes with flowers and suns on them, I feel like it's a funeral for a carnival worker. She even suggested we have beer kegs on tap.  So the last straw was that her and her mother, without my consent, used my credit card as a payment on a venue down by a river instead of the church we discussed where my family has attended for generations and made many contributions, the pricing was even a little cheaper minus the price of the hall afterwards. Who wants to get married next to a stinking river full of flies and whatever other insects will float around, on top of all the people who will just waltz up to the river to enjoy the day while were trying to get married.", "options": {"1": "insist we book the church or not get married at all", "2": "continue to go along with her plans"}},
{"id": 21, "text": "I'd like to start by saying my father (age 60?) is a high-functioning alcoholic, and emotionally/verbally abusive. He wasn't always like that but he has been for roughly 6-8 years now.  My mother is fully aware of his condition and does not purchase alcohol for him. So he finds other ways, either by asking my older sister or brother to bring him some when they come visit, or paying friends to get alcohol for him. My older siblings (mid-30's) live away from home. I know my siblings are enablers in this but they don't seem to realize he has a problem; though they themselves have alcoholic tendencies, they're not as bad as my father. My mother doesn't drink much and I do very rarely but only when I'm with people I trust.  I'm a college student (25F) also living away from home but I do visit on the weekends or during breaks, so currently I'm home for the remainder of spring break. As my siblings are not here and his friends are busy, my father asked me to go to the liquor store and buy him wine. This is strange as he's never asked me to do this, but he won't go himself because he 'doesn't want to be seen there.'  I was working on an assignment in my bedroom when he came to ask me. I don't want to do it, even though saying 'no' to him still makes me very nervous because I never know how he'll react.", "options": {"1": "refuse to buy him alcohol", "2": "appease him and agree to buy him alcohol"}}, 
{"id": 22, "text": "My dad left me, my sister, and my mom, when I was 9 (sister too, we're twins.) He came for a few visits and then disappeared. Years later, we realized he sexually molested my sister, forced him to court, and afterward he went into hiding.  For the past, what? 6 years? We heard nothing, but 1 year ago we found out he had died. After a strange emotional roller coaster my sister made an account on 23andMe and we've found 3 people that match with us.  One of them, however, is a girl one year older than us. My sister messaged her and asked about her parents. She says *both* of her parents raised her. Which means either A: Her mother cheated on her 'dad' with *my* dad or B: The mother used a sperm donor and no one knows about it. My sister felt really bad for messaging her but she didn't give her any details to imply in *which* way we're related. I brought this all up to my mother and she thinks it's really wrong to seek these people out and that we could ruin some one's life like this. (Such as the girl I mentioned) But I also feel like I have a right to want to meet my half-siblings.",  "options": {"1": "reveal these possibilities to the girl", "2": "not share this information"}},
{"id": 23, "text": "I'll preface this with some background. Surrogacy is legal where I live, and has been since 2012. My wife and I will be married for 5 years as of this November, and have been together for 8 years. We have 2 boys, a 5 and a 6 year old. She stays at home whilst I go out and work a 9 to 5 to support the family, and for the most part we're content, with the genral challenges which come with a relationship. Now we were talking about having another child. She had her implanon (contraceptive implant) removed so we can start trying. I'm pretty excited, I'm in a really stable job with good career prospects, and I'm in love with my wife. We have a family which comes with it's own challenges of course.   This morning, she comes in to the kitchen all nervous; I ask what's up? She takes a deep breath and says she wants to be a surrogate for someone she met 2 weeks ago. This wasn't exactly the statement I was expecting on a Sunday morning in the kitchen. Initially, I'm not feeling any negativity, and my wife rattles off a list of requirements which includes me needing to be on board with it. This is about when I became triggered as the concept settles in, and I started shutting off in a confused state of anxiety. The issues are as follows;  * She's known this woman (a fellow home school mother in our community) for about 2 weeks. * This would put having our own child on hold. * I'm worried there will be attachment issues after the pregnancy. * If I'm not on board, I'll likely push my wife away. * There may be financial implications; we aren't in a position to support someone elses pregnancy.  I understand; this is her body, and ultimately I cannot stop her from doing what she wants to do. If she really wants to do this, she will take our children away and do it on her own.  I'm currently trying to go through scenarios where I would feel comfortable with the idea, and I think this ultimately comes down to the fact that it feels like she's prioritizing someone elses child over ours (This makes me feel a bit rejected) for someone she's known for a very short time. I've worked so hard to support her in what she wants to do in every way (Stay at home, home school the kids), however I don't think this is something I can get behind, at least not until we've had our 3rd child which we literally just started planning for.", "options": {"1": "agree to the surrogacy", "2": "refuse to agree to the surrogacy"}},
{"id": 24, "text": "So I've had concert tickets since October, and my girlfriend knew about this. A few days ago we realized that it is on the exact same day and time as our graduation. This concert is a very important one to me, because the artist's music completely changed my life. I told her that I'm not sure if I wanted to go to the graduation party over the concert, and she flipped. I think it's unfair given that I had to save up a lot of money for me to pay for my ticket, also taking into account that she has known since October. She argues that it's important I'm there since I have a commitment with her family, and she argues that they all like me a lot and says that might change if I'm not there. They paid for my entry to the graduation party, but I'd be more than glad to pay it back. I know this may sound silly, but to me it's not.", "options": {"1": "attend the graduation party and skip the concert", "2": "attend the concert and miss the graduation party"}},
{"id": 25, "text": "A few months ago around June, I(16F at the time) met my former best-friend(17M). We'll call him R. It's important to note that we were both depressed and had suicidal thoughts at the time.  After about two months of friendship, he messaged me saying that he was done with life and really just wanted to end it. I was obviously worried and spent several hours trying to talk him out of it. It's important to note that he has attempted suicide before so this wasn't just edgy teen behavior. In this time where I was trying to talk him down he said that he's been lying to me this whole time, that he just fakes the emotions he should feel including any love he claimed to have had for me. That he's lied about several things in our relationship.  He admitted that he was stringing me in a web of lies to get me to love him for these few weeks. I didn't care at the moment I just didn't want him to hurt himself. I told him to sleep on it and to not make any rash decisions until the morning. I hoped that it was all going to blow over and he'd come to his senses by morning, but he didn't.  In the morning he was still suicidal. I knew this wasn't just going to blow over so I had tried to text the Netherlands PD to try to get them to stop him. It didn't go through so I messaged his mom on Facebook and tried connecting to his siblings on Steam. I just wanted them to stop him and get him the help he needs or at least catch him soon enough to save his life. The Netherlands has universal healthcare so if he was admitted at any point I knew there wouldn't be a financial burden to his family. He has an abusive father so I tried to keep him as far out of the picture as possible and hoped that any bruises he had on his body would be noted by authorities and investigated. I would have warned the police about this if I was able to get through. I told him what I did and he said that if I didn't delete the friend requests I had sent to them and delete the message I had sent to his mom he would tell my mom everything I had told him. Which would include me being bisexual (my mom is homophobic and has stated before that I better not become a lesbian), my suicidal tendencies (not as bad as his but would likely ruin our relationship) and all of the things I had said about her. He gave me the option to remain his friend though he wouldn't guarantee that he would be around for much longer and if he had stopped messaging to assume the worst.", "options": {"1": "delete the friend requests and messages as he asked", "2": "refuse to delete the friend requests and messages"}},
{"id": 26, "text": "I left my abusive ex and I had a pregnancy scare and he kept texting me to see if I had taken a test yet. Well I'm not pregnant but I just really feel like there's no point in even telling him that because the only way I would talk to him would be if I was pregnant. If I text him to let him know this oh, he's going to think that I've opened up the door to a conversation again which I don't want to do.  I just think that if I don't text him then maybe he'll put two and two together and figure out that I'm not. I mean I thought about just emailing him instead of texting him but I don't want the barrage of texts and phone calls that would come after that. I've been enjoying the silence from him.",  "options": {"1": "contact him to let him know that I'm not pregnant","2": "not contact him"}},
{"id": 27, "text": "I'm pan (or bi, whatever you want to call it. point is, couldn't care less) and a 17yo female. I have tried coming out to my mom for several years, before I started dating my girlfriend. I tried, and she shut me down telling me that I couldn't know, and that she couldn't handle having another gay kid (my brother who is much older than me came out gay about 5 years ago, but since then, he has married a woman and had kids...which...is confusing...I know...). She goes off about wanting grandkids, which is hilarious since...now that she thinks I'm straight and talking about never having kids she's suddenly okay with it!  Since the past 3 times I've tried coming out (once when I was 14, another time when I was 15 dating a guy, and when I was 16 and dating this girl), whenever I bring up LGBTQ issues she 'accuses me' of being gay. I have to shut her down, because she gets livid every time, and I just can't deal with it.  However, I love my mom. I love my mom so much. She's such a good mom, and this is the only thing in the world I wish she could be better about. She has done so much for me, and it's clear she cares about me so much. She only wants the best for me, and I know that. It's not even really like she's homophobic. She's not against gay marriage or gay people, or anything. She doesn't care when it comes to anyone else, just her kids...but not even really my brother. It's just me. She just can't handle *me* not being straight...  And then it happened. 6 years ago, I met this girl. And like, I knew she was pretty. But when we got older, and both realized yknow...we were super gay...and at that gay for EACH OTHER (crazy right?),we started dating. We've been dating since 2 years ago, probably closer to 2 and a half now. And we have been through so much together. I know I'm young and its probably crazy to say, but I love this girl more than most things in life. She reminds me of sunflowers and roses and pretty sounds and pretty smells and she's just so wonderful. I want my driver's license so bad just so I can see her more often, and I want to move into my own apartment so she can live with me. I can't wait to see where our relationship goes so that one day, I can settle down with her. Obviously though...I haven't told my mom.  And she knows this girl. She knows this girl and her family very well since we were friends for so long before this happened. But she has no idea that I'm madly in love with her. And I feel so terrible about it everyday. I text this girl that she's one of the best things to ever happen to me while sitting across from my mom as we go eat lunch and she asks me about why I'm not looking to date any boys right now. It's terrible and I feel so bad.   I can't see myself ever telling my mom either, because I'm so afraid of losing her, and losing her love and support. I also feel like she would be so hurt that I hid it from her for so long, but its not like I haven't tried telling her either. It scares me so much that now when my mom asks if I'm gay I just straight up say no, because if I say yes she'll probably get upset.   It depresses me so much, because I love my mom, but I'm not about to give up on someone so special to me either." , "options": {"1": "tell my mom I'm gay and dating my girlfriend", "2": "continue to hide my relationship status from her"}},
{"id": 28, "text": "The story is that my wife's childhood friend (acquaintance now) is breaking up with her boyfriend and father of her 9 month old daughter. The boyfriend is not a good guy and is constantly having problems with the law. He has been verbally and somewhat physically abusive towards her. There is also a pretty good chance that he will be going to jail in the next few months for his 2nd DUI, a hit and run, and drug possession.  He also found a new GF and is moving out of their apt. She can't afford the rent because he was very controlling of her and wouldn't let her work and wouldn't pay to get her car fixed so she could go and get a job. Like I said, I am not downplaying that he is a major shit bag.  My wife helped her friend pack up his items last night and then came home and unloaded the story on me.  It turns out that this friend has been in a lot of trouble herself. She lost her job with the Department of Child Services for performance issues that were caused by her starting to use Meth. The meth use stemmed from the guy she was dating prior to this boyfriend. He was a drug dealer and eventually OD'd. She claimed that the stress from him dying is what lead her to try Meth as a way to cope.  There is a bigger story at play. The old boyfriend was being investigated for his role in selling bad drugs to two other people who ended up OD'ing. She was also involved in it - and from my knowledge had either withheld evidence or destroyed evidence. So there is still an active investigation going on. There is a possibility that she could be wrapped up in this.  My wife and I are pretty charitable people. We try to help people when we can. That is not the issue for me. My issue is that my wife wants to let her friend and the child move in here for 2 months until she can get back on her feet.  However, the biggest thing for me is that I don't want that drama in my home. I don't want to be involved in any issues between the father of her daughter. He seems like the type of person to retaliate, and I don't want to risk something happening at my home with my family here. I especially don't want to be involved in any situations with the law. We both have very good jobs and I don't want to risk anything with being associated with some sort of criminal investigation.  When I rose these concerns (especially our children) she said that she thinks it would show them a real life lesson. That not everyone is a good person, but it's always good to help when people need help - regardless of their situation. When I shared these thoughts, my wife stormed away and told me that I was being selfish.", "options": {"1": "allow my wife's friend and daughter to stay with us", "2": "pay the first month's rent for my wife's friend to get an apartment elsewhere", "3": "not help my wife's friend and daughter"}},
{"id": 29, "text": "My brother and his wife are both carriers for the recessive allele for Tay Sach’s Disease. If you didn’t know, Tay Sach’s Disease restricts the production of a protein vital for the development of muscle and tissue, which leads to complications during the development process. Often times this genetic disorder leads to decreased motor control, enlarged internal organs, and the loss of functioning sensory organs with time (primarily vision). My brother and his wife are both practicing Catholics and recently announced that they are having another child. This disease renders a child with both recessive alleles, for lack of a better term, a vegetable by the time they hit five years old. Their first daughter has Tay Sach’s disease. They are now expecting another child with the 50% chance of inheriting the terminal illness. If I suggest to my brother to get an abortion or at least a vasectomy, I’m afraid I’m going to get extreme backlash from my family but I feel like it’ll be worse on everyone, his family, our parents, his wife’s parents, to have another child brought into the world with such an agonizing future ahead of them. I’ll be honest, it destroys me that they are going to potentially have two children with this terrible condition and I can’t help but be angry at the both of them for letting their religious beliefs get in the way (I believe they’re against contraception and abortion). Financially, this scenario will ruin them as well. I do want to respect their choice to keep the child but I feel like they knew the risk of having unprotected sex when clearly they are carriers.", "options": {"1": "ask my brother to get an abortion or vasectomy", "2": "respect his choice and say nothing"}},
{"id": 30, "text": "This has been bothering me for months, bouncing around inside my head. Last year, my mother started using one of those singing apps. I think it was called Smule. She tried putting her voice out, and after getting lots of positive attention, ended up getting obsessed with singing.   My problem is that she spends too much time on it. She'll constantly have her earphones plugged in both ears, either singing or listening to music. She does this while driving, preparing for work, putting herself to sleep, and basically all of her free time.  Being constantly on that app is a problem for the rest of our family.   My father gets irritated because she barely hears him speak, and thinks it's dangerous to drive with earphones plugged in. He also complains that she doesn't spend enough time with our family.  My mother will start recording herself singing randomly, so she'll shout at me and my sister to not make a peep. If we make any kind of noise (coughing or sneezing included) near her, she gets angry, telling us we're spoiled children. Once in a while she'll play a victim card, complaining that her life is boring, singing makes her happy, and bothering her makes her want to kill herself. I don't really care about her complaints, but I'm worried my young, impressionable sister might start copying her behavior.  I try to talk to my mother, but most of the times she has her air pods in, so she'll either rip them out, with an annoyed look on her face, or just not hear me at all.   I feel like this is my fault somehow.  It just pushes my insecurities, making me wonder what is happening to our relationship. I've broken down to my father about it, but my mother got defensive when he tried to talk to her about it. I've tried to confront her on these problems, but every time I tell her about how uncomfortable I feel about her hobby, she *snaps.* She'll tell me that she hates her life, and using her app is the only thing that makes her happy. She'll sarcastically call me a princess, and says that she isn't just my servant. I just want to have a conversation with her. I barely get to see my parents because of our busy schedules. Talking to my mother in a car ride for more than two minutes is a damn privilege. I have so many mixed feelings, it's hard to put into words everything about this.","options": {"1": "continue to ask that she stops using the app", "2": "respect her wishes to use the app"}},
{"id": 31, "text": "Let me start at the beginning. My parents and I have never had a great relationship, I was adopted by them when I was 5, and honestly a pretty hard headed kid, so was my brother who was adopted with me (blood brother), that being said I always lied to them, did stupid kid stuff, and we fought I am not exaggerating, daily.  Onto the story. I turned 18 in January of 2018. On May 18th, 2018 in Santa Fe Texas, Dimitrios Pagourtzis brought a sawed off shotgun to school, around 7:30 ish I believe it was, a fire alarm went off, I was doing my makeup in first period, as it was the end of the year and we didn’t have much to do in class.  Everyone thought it was a drill, until we were outside of the school, we heard a shotgun go off in the art wing. Everyone ran, everyone was terrified, we now knew this wasn’t a drill, and ran to the nearest safe place.  8 students and 2 substitute teachers passed away.  Now that you have the gruesome details, here is how I decided to go about it.  The Sunday after the shooting, I went to church as well as most of Santa Fe. I shook hands with governor Greg Abbott, he asked me a question or two about school security and what we can do to improve it, and I gave him an honest answer, telling him the doors are not secure, and this is coming from someone who would have teachers cover for me to sneak out of class and go home early almost daily. MSNBC saw my answer with Greg, and asked me to do an interview, I texted my mom after the service and she was very excited... Then my dad heard about it. He threatened to take my truck if I did the interview, he felt like I would ruin his business by saying something stupid. But I NEED to inform other schools on how to make things a little safer, as in, locking doors during school hours (Dimitrios came in after class had started through an unlocked door) as well as being more strict in certain things.","options": {"1": "do the interview", "2": "decline the interview"}},
{"id": 32, "text": "Long story short. Last December my mother in-law had a breakdown over finances and tried to take her own life. The doctors said she couldn't live by herself anymore so my wife put her mothers apartment to rent and brought the stuff that was there to our home. She got to leave the hospital in the end of January and has been living with us ever since. (The uber ride home was awkward to say the least, she was heavily drugged and among other stuff she told the driver 'I haven't seen a dick in years. My daughter is into BBC, she's married to that nigger over there'. I don't have a problem with the word and she was obviously high. But the look of pity the driver gave me definitely stung). I was not thrilled to the prospect of her moving in but given the circumstances I had no choice. I do my best to be nice and make her feel wellcome. But I'm not happy, not at all, i don't feel home anymore, i don't want to break my wifes heart by telling her all this.","options": {"1": "tell my wife how I feel", "2": "not tell my wife how I feel"}},
{"id": 33, "text": "I’ll start with the situation first and then get into the backstory. My best friends girlfriend is having HER birthday party today at her house. She is inviting my group of friends (through her boyfriend, the guys) and her group of friends (the girls), but she explicitly said not to invite this person (let’s call him Fred) who is in our group.  Backstory: Both of our groups have hung out together multiple times before, including Fred. Fred can be socially awkward, especially with girls. He’s been known to have a crush on a few of the girls there and supposedly acted creepy with them (although it happened a while ago). As a result half of the girls don’t like him. Normally he catches wind of the party because we talk about it around him (he is our friend after all) and since no one specifically said not to invite him (until now) we always let him come along. It was always just our group and the girls group. I would definitely be the asshole for inviting Fred to her birthday party since she specifically said not to, but I still feel like an asshole for leaving him out since he is my friend too","options": {"1": "invite Fred", "2": "not invite Fred"}},
{"id": 34, "text": "My boyfriend of 3 years has gone on a beach vacation with his high school/college friends every summer for a few years. One of the families rents a 20 person house on the beach and they stay for a week. He went the first summer we were together and they offered that I could come also, but i didn't have enough vacation time at work yet so i declined. The beach trip hasn't happened for the last 2 years due to jobs and other responsibilities.  Last night my boyfriend got a message from his friend that organizes these trips saying that it was happening this year and he was welcome to come. When he asked if I was invited they said they have to see if anyone else backs out because they don't have room for me.  I don't want my boyfriend to go if I am unable to go, but I also don't want to keep him from seeing his friends." , "options": {"1": "ask my boyfriend not to go without me", "2": "let my boyfriend go without me"}},
{"id": 35, "text": "My parents recently have entered their elder years and with that has come absentmindedness and forgetfulness. This has caused my dad to start telling me many stories he has told me before over the course of my life. I love my dad and I love his stories but where it used to be he would repeat a story maybe once over a decade, he now will tell me the same story within months. I smile and nod and listen to him tell most of it and then midway through I kindly mention that he told me that before/recently. He just laughs and says oh well and I laugh too. My sister says to just let him tell the story but we're all adults here and my dad always tells me I have a pass to mess with him if he gets Alzheimer's and asks me the same question repeatedly, I feel I should let him know if he repeats a story too but I know the common courtesy is to let the elders speak.", "options": {"1": "tell him when he is repeating a story", "2": "let him repeat stories without telling him"}}]

